<?php
declare (strict_types=1);

/**
 * Author:
 *
 *   ┏┛ ┻━━━━━┛ ┻┓
 *   ┃　　　━　　  ┃
 *   ┃　┳┛　  ┗┳  ┃
 *   ┃　　　-　　  ┃
 *   ┗━┓　　　┏━━━┛
 *     ┃　　　┗━━━━━━━━━┓
 *     ┗━┓ ┓ ┏━━━┳ ┓ ┏━┛
 *       ┗━┻━┛   ┗━┻━┛
 * DateTime: 2022-02-26 14:39:36
 */

return [
    'driver' => 'redis',
    'max_len' => 80,
    // 热度排名
    'heat' => [
        'persist' => 1000, // 默认保留
        'del' => 100, // 满足长度后删除排名靠后的
    ],
    // 时序排名
    'seq' => [
        'persist' => 1000, // 默认保留
        'del' => 100, // 满足长度后保留从N位裁剪掉
    ]
];